In [3]:
people={
    "first":["corey","jane","john"],
    "last":["schafer","doe","doe"],
    "email":["coreyMachafer@gmail.com","janedoe@gmail.com","johndoe@gmail.com"]
}

In [4]:
people['email']

['coreyMachafer@gmail.com', 'janedoe@gmail.com', 'johndoe@gmail.com']

In [5]:
import pandas as pd

In [6]:
df=pd.DataFrame(people)

In [7]:
df

   first     last                    email
0  corey  schafer  coreyMachafer@gmail.com
1   jane      doe        janedoe@gmail.com
2   john      doe        johndoe@gmail.com

In [8]:
df.set_index('email', inplace=True)

In [9]:
df.index

Index(['coreyMachafer@gmail.com', 'janedoe@gmail.com', 'johndoe@gmail.com'], dtype='object', name='email')

In [10]:
df.loc['coreyMachafer@gmail.com','first']

'corey'

In [11]:
df.iloc[0:4]

                         first     last
email
coreyMachafer@gmail.com  corey  schafer
janedoe@gmail.com         jane      doe
johndoe@gmail.com         john      doe

In [12]:
import pandas as pd

In [13]:
data=pd.DataFrame({'Brand':['Maruti','Benz','Hyundai','Tata','Mahindra','Renault','BMW','Auadi','RR'],'year':[2012,2000,2001,2002,2003,1998,1999,1999,2000],'kms Driven':[50000,20000,2500,1500,2300,13509,4058,5987,4890],'city':['Chennai','Pune','Mumbai','kolkata','Bangalore','Delhi','Vizag','Guragon','Ghaizabad'],'Milaege':[25,23,21,19,23,43,21,23,34]},)

In [14]:
data

      Brand  year  kms Driven       city  Milaege
0    Maruti  2012       50000    Chennai       25
1      Benz  2000       20000       Pune       23
2   Hyundai  2001        2500     Mumbai       21
3      Tata  2002        1500    kolkata       19
4  Mahindra  2003        2300  Bangalore       23
5   Renault  1998       13509      Delhi       43
6       BMW  1999        4058      Vizag       21
7     Auadi  1999        5987    Guragon       23
8        RR  2000        4890  Ghaizabad       34

In [15]:
data.loc[(data.Brand=='Maruti')&(data.Milaege>20)]

    Brand  year  kms Driven     city  Milaege
0  Maruti  2012       50000  Chennai       25

In [16]:
data.loc[2:5]

      Brand  year  kms Driven       city  Milaege
2   Hyundai  2001        2500     Mumbai       21
3      Tata  2002        1500    kolkata       19
4  Mahindra  2003        2300  Bangalore       23
5   Renault  1998       13509      Delhi       43

In [17]:
data.iloc[2:5]

      Brand  year  kms Driven       city  Milaege
2   Hyundai  2001        2500     Mumbai       21
3      Tata  2002        1500    kolkata       19
4  Mahindra  2003        2300  Bangalore       23

In [18]:
data.set_index('Brand')

          year  kms Driven       city  Milaege
Brand
Maruti    2012       50000    Chennai       25
Benz      2000       20000       Pune       23
Hyundai   2001        2500     Mumbai       21
Tata      2002        1500    kolkata       19
Mahindra  2003        2300  Bangalore       23
Renault   1998       13509      Delhi       43
BMW       1999        4058      Vizag       21
Auadi     1999        5987    Guragon       23
RR        2000        4890  Ghaizabad       34

In [19]:
data.reset_index(inplace=True,)

In [20]:
data

   index     Brand  year  kms Driven       city  Milaege
0      0    Maruti  2012       50000    Chennai       25
1      1      Benz  2000       20000       Pune       23
2      2   Hyundai  2001        2500     Mumbai       21
3      3      Tata  2002        1500    kolkata       19
4      4  Mahindra  2003        2300  Bangalore       23
5      5   Renault  1998       13509      Delhi       43
6      6       BMW  1999        4058      Vizag       21
7      7     Auadi  1999        5987    Guragon       23
8      8        RR  2000        4890  Ghaizabad       34

In [21]:
data.to_string(index=False)

' index    Brand  year  kms Driven      city  Milaege\n     0   Maruti  2012       50000   Chennai       25\n     1     Benz  2000       20000      Pune       23\n     2  Hyundai  2001        2500    Mumbai       21\n     3     Tata  2002        1500   kolkata       19\n     4 Mahindra  2003        2300 Bangalore       23\n     5  Renault  1998       13509     Delhi       43\n     6      BMW  1999        4058     Vizag       21\n     7    Auadi  1999        5987   Guragon       23\n     8       RR  2000        4890 Ghaizabad       34'

In [22]:
data

   index     Brand  year  kms Driven       city  Milaege
0      0    Maruti  2012       50000    Chennai       25
1      1      Benz  2000       20000       Pune       23
2      2   Hyundai  2001        2500     Mumbai       21
3      3      Tata  2002        1500    kolkata       19
4      4  Mahindra  2003        2300  Bangalore       23
5      5   Renault  1998       13509      Delhi       43
6      6       BMW  1999        4058      Vizag       21
7      7     Auadi  1999        5987    Guragon       23
8      8        RR  2000        4890  Ghaizabad       34

In [23]:
data=pd.DataFrame

In [26]:
data.shape

In [25]:
data.info

<function pandas.core.frame.DataFrame.info(self, verbose: 'bool | None' = None, buf: 'WriteBuffer[str] | None' = None, max_cols: 'int | None' = None, memory_usage: 'bool | str | None' = None, show_counts: 'bool | None' = None) -> 'None'>